spcalendarpro.min.js

/*
* @name SPCalendarPro
* Version 2018.01
* No dependencies!
* @description An ultra lightweight JavaScript library to easily manage SharePoint calendar events.
* @category Plugins/SPCalendarPro
* @author Sam Perrow sam.perrow399@gmail.com
*
* Copyright 2018  Sam Perrow  (email : sam.perrow399@gmail.com)
* Licensed under the MIT license:
* http://www.opensource.org/licenses/mit-license.php
*/

!function(e,t){e.spcalpro=function(){function e(e,t){return{beginDateTime:e,beginDate:e.toDateString(),beginTime:e.toTimeString(),endDateTime:t,endDate:t.toDateString(),endTime:t.toTimeString()}}r.prototype.isSameDate=function(){var e=this.userDateTimes.startDate,t=this.userDateTimes.endDate;return this.events=this.events.filter(function(n){return new Date(n.EventDate).toDateString()===e&&new Date(n.EndDate).toDateString()===t}),this},r.prototype.matchDateTimes=function(){var e=this.userDateTimes.startDateTime,t=this.userDateTimes.endDateTime;return this.events=this.events.filter(function(n){return new Date(n.EventDate)<=e&&new Date(n.EndDate)>=t}),this},r.prototype.isTimeConflict=function(){var e=this.userDateTimes.startDateTime,t=this.userDateTimes.endDateTime;return this.events=this.events.filter(function(n){var r=n.EventDate,a=n.EndDate;return e<=r&&t>=a||r<e&&a>e||r<t&&a>t||e<r&&t>a}),this},r.prototype.where=function(e){var t=e.split(" ")[0],n=e.split(" ")[1],r=e.split(" ")[2],a={"=":function(e,t){return e==t},">":function(e,t){return e>new Number(t)},"<":function(e,t){return e<new Number(t)},">=":function(e,t){return e>=new Number(t)},"<=":function(e,t){return e<=new Number(t)},"!=":function(e,t){return e!=t}};return this.events=this.events.filter(function(e){return a[n](e[t],r)}),this},r.prototype.getDateTimesFromForm=function(t,r){var a=n(t,r);return this.userDateTimes=e(a.userBeginDT,a.userEndDT),this},r.prototype.getEventsAfterToday=function(){return this.events=this.events.filter(function(e){var t=new Date;return e.EventDate>=t||e.EndDate>=t}),this},r.prototype.provideDateTimes=function(t,n){return this.userDateTimes=e(t,n),this};var t=function(e,t,n){var r="<soap:Envelope xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance' xmlns:xsd='http://www.w3.org/2001/XMLSchema' xmlns:soap='http://schemas.xmlsoap.org/soap/envelope/'><soap:Body><GetListItems xmlns='http://schemas.microsoft.com/sharepoint/soap/'><listName>"+e.listName+"</listName>",a="<DateRangesOverlap><FieldRef Name='EventDate'/><FieldRef Name='EndDate'/><FieldRef Name='RecurrenceID'/><Value Type='DateTime'><Year/></Value></DateRangesOverlap>",i="</Where><OrderBy><FieldRef Name='EventDate'/></OrderBy></Query></query><queryOptions><QueryOptions><RecurrencePatternXMLVersion>v3</RecurrencePatternXMLVersion><ExpandRecurrence>TRUE</ExpandRecurrence><RecurrenceOrderBy>TRUE</RecurrenceOrderBy><ViewAttributes Scope='RecursiveAll'/></QueryOptions></queryOptions></GetListItems>",s=r+("single"===n?"<query><Query><Where><Eq><FieldRef Name='fRecurrence'/><Value Type='Number'>0</Value></Eq></Where></Query></query></GetListItems>":"recurring"===n?"<query><Query><Where><And>"+a+"<Eq><FieldRef Name='fRecurrence'/><Value Type='Number'>1</Value></Eq></And>"+i:"<query><Query><Where>"+a+i)+"</soap:Body></soap:Envelope>";return function(n){var r=e.soapUrl,a=new XMLHttpRequest;function i(){if(4==a.readyState&&200==a.status)return e.events=function(e){for(var t=[],n=0;n<e.length;n++){var r={},a=e[n].attributes;if("z:row"===e[n].nodeName){for(var i=0;i<a.length;i++){var s=a[i].name,u=s.split("ows_")[1];r[u]="EventDate"===u||"EndDate"===u?new Date(a[i].value.replace("-","/")):a[i].value}t.push(r)}}return t}(a.responseXML.querySelectorAll("*")),e.callback?e.callback(e):e}a.open("POST",r,t),a.setRequestHeader("X-Requested-With","XMLHttpRequest"),a.setRequestHeader("Content-Type",'text/xml;charset="utf-8"'),a.send(n),!0===t?a.onload=function(){i()}:i()}(s),e.events};String.prototype.formatInputToHours=function(){var e=this.split(" "),t=Number(e[0]);return"PM"===e[1]&&t<12?t+=12:t};var n=function(e,t){function n(e){var t=document.querySelectorAll('input[id$="DateTimeField_DateTimeFieldDate"]')[e].parentNode.parentNode,n=t.getElementsByClassName("ms-dttimeinput")[0];if(n)var r=n.getElementsByTagName("select")[0].value,a=n.getElementsByTagName("select")[1].value;return{date:t.getElementsByTagName("td")[0].getElementsByTagName("input")[0].value,time:function(){return r&&a?r.formatInputToHours()+":"+a:""}}}e=e||0,t=t||1;var r=n(e),a=n(t);return{userBeginDT:new Date(r.date+" "+r.time()),userEndDT:new Date(a.date+" "+a.time())}};function r(e){return this.listName=e.listName,this.userDateTimes={},this.soapUrl=e.sourceSite?e.sourceSite+"/_vti_bin/Lists.asmx":function(){var e={};15===_spPageContextInfo.webUIVersion?(e.year="2013",e.soapURL=_spPageContextInfo.webAbsoluteUrl+"/_vti_bin/Lists.asmx"):(e.year="2010",e.soapURL=document.location.protocol+"//"+document.location.host+_spPageContextInfo.webServerRelativeUrl+"/_vti_bin/Lists.asmx");return e}().soapURL,this.callback=function(){return e.callback?e.callback(this):null},this.events=t(this,e.async,e.type),this}return{getEvents:function(e){return new r(e)},getDateTimesFromForm:function(t,r){var a=n(t,r);return e(a.userBeginDT,a.userEndDT)}}}()}(this);